n5/src/Catalogs/Education/Education.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Education</name>
  <owners>Catalog.Individuals</owners>
  <attributes>
    <name>Document</name>
    <type>
      <types>CatalogRef.EducationDocuments</types>
    </type>
  </attributes>
  <attributes>
    <name>FromDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Institution</name>
    <type>
      <types>CatalogRef.Institutions</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Profession</name>
    <type>
      <types>CatalogRef.Professions</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ToDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>CatalogRef.EducationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/Education/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )

	if ( not checkPeriods () ) then
		Cancel = true;
	endif; 
	
EndProcedure

Function checkPeriods ()
	
	if ( not Periods.Ok ( FromDate, ToDate ) ) then
		Output.PeriodError ( , "ToDate" );
		return false;
	endif;
	if ( not Periods.Ok ( ToDate, ValidTo ) ) then
		Output.PeriodError ( , "CompletionDate" );
		return false;
	endif;
	return true;
	
EndFunction 

#endif
